---
kind: enumMember
id: F:Autodesk.Revit.DB.WorksetConfigurationOption.OpenAllWorksets
enum: Autodesk.Revit.DB.WorksetConfigurationOption
source: html/2fe5f0c1-c4c7-ea97-541c-5ee61b397dce.htm
---
# Autodesk.Revit.DB.WorksetConfigurationOption.OpenAllWorksets

Open all user-created worksets by default. Additional open requests will be ignored for this type of configuration.